In [39]:
import pandas as pd

In [40]:
df = pd.read_excel('quarterly_tfp.xlsx', sheet_name='quarterly')

In [79]:
print(df.columns)

Index(['Note:  All variables are percent change at an annual rate (=400 * change in natural log). Produced on March 07, 2023 10:54 AM', 'Unnamed: 11'], dtype='object')

In [80]:
selected_columns = ['Note:  All variables are percent change at an annual rate (=400 * change in natural log). Produced on March 07, 2023 10:54 AM', 'Unnamed: 11']
df_selected = df[selected_columns]
df = df[selected_columns]  # Modify the existing DataFrame
df

,"Note: All variables are percent change at an annual rate (=400 * change in natural log). Produced on March 07, 2023 10:54 AM",Unnamed: 11
0,date,dtfp
1,1947:Q1,NaN
2,1947:Q2,-0.222961
3,1947:Q3,-3.793172
4,1947:Q4,3.472945
...,...,...
306,Full sample mean,1.187898
307,Since 1995:4,0.924773
308,Since 2001:1,0.699707
309,Past 8 qtrs,-0.07806
310,Past 4 qtrs,-1.834685

In [46]:
print(df_selected.columns)

Index(['Note:  All variables are percent change at an annual rate (=400 * change in natural log). Produced on March 07, 2023 10:54 AM', 'Unnamed: 11'], dtype='object')

In [81]:
column_mapping = {
    'Note:  All variables are percent change at an annual rate (=400 * change in natural log). Produced on March 07, 2023 10:54 AM': 'date',
    'Unnamed: 11': 'tfp'}

In [83]:
df_selected = df_selected.rename(columns=column_mapping)
df_selected

                 date       tfp
0                date      dtfp
1             1947:Q1       NaN
2             1947:Q2 -0.222961
3             1947:Q3 -3.793172
4             1947:Q4  3.472945
..                ...       ...
306  Full sample mean  1.187898
307      Since 1995:4  0.924773
308      Since 2001:1  0.699707
309       Past 8 qtrs  -0.07806
310       Past 4 qtrs -1.834685

[311 rows x 2 columns]

In [49]:
print(df_selected.columns)

Index(['date', 'tfp'], dtype='object')

In [50]:
print(df_selected)

                 date       tfp
0                date      dtfp
1             1947:Q1       NaN
2             1947:Q2 -0.222961
3             1947:Q3 -3.793172
4             1947:Q4  3.472945
..                ...       ...
306  Full sample mean  1.187898
307      Since 1995:4  0.924773
308      Since 2001:1  0.699707
309       Past 8 qtrs  -0.07806
310       Past 4 qtrs -1.834685

[311 rows x 2 columns]

In [57]:
selected_column = 'date'

In [60]:
column_data_type =  df_selected[selected_column].dtype

In [61]:
print(column_data_type)

object

In [64]:
df_selected['date']

0                  date
1               1947:Q1
2               1947:Q2
3               1947:Q3
4               1947:Q4
             ...
306    Full sample mean
307        Since 1995:4
308        Since 2001:1
309         Past 8 qtrs
310         Past 4 qtrs
Name: date, Length: 311, dtype: object

In [84]:
selected_rows = df_selected.iloc[141:302]
selected_rows

        date       tfp
141  1982:Q1 -4.782231
142  1982:Q2 -1.377697
143  1982:Q3 -2.636626
144  1982:Q4  0.109814
145  1983:Q1  2.199907
..       ...       ...
297  2021:Q1  1.367254
298  2021:Q2  1.193527
299  2021:Q3  0.641803
300  2021:Q4  3.511677
301  2022:Q1 -3.638582

[161 rows x 2 columns]

In [72]:
print(selected_rows)

        date       tfp
141  1982:Q1 -4.782231
142  1982:Q2 -1.377697
143  1982:Q3 -2.636626
144  1982:Q4  0.109814
145  1983:Q1  2.199907
..       ...       ...
298  2021:Q2  1.193527
299  2021:Q3  0.641803
300  2021:Q4  3.511677
301  2022:Q1 -3.638582
302  2022:Q2 -3.575845

[162 rows x 2 columns]

In [86]:
df_selected = selected_rows
df_selected

        date       tfp
141  1982:Q1 -4.782231
142  1982:Q2 -1.377697
143  1982:Q3 -2.636626
144  1982:Q4  0.109814
145  1983:Q1  2.199907
..       ...       ...
297  2021:Q1  1.367254
298  2021:Q2  1.193527
299  2021:Q3  0.641803
300  2021:Q4  3.511677
301  2022:Q1 -3.638582

[161 rows x 2 columns]

In [75]:
print(df_selected)

        date       tfp
141  1982:Q1 -4.782231
142  1982:Q2 -1.377697
143  1982:Q3 -2.636626
144  1982:Q4  0.109814
145  1983:Q1  2.199907
..       ...       ...
297  2021:Q1  1.367254
298  2021:Q2  1.193527
299  2021:Q3  0.641803
300  2021:Q4  3.511677
301  2022:Q1 -3.638582

[161 rows x 2 columns]

In [89]:
tfp_column = df_selected[['tfp']]
df_selected = tfp_column
df_selected

#just selecting the column of total factor productivity

          tfp
141 -4.782231
142 -1.377697
143 -2.636626
144  0.109814
145  2.199907
..        ...
297  1.367254
298  1.193527
299  0.641803
300  3.511677
301 -3.638582

[161 rows x 1 columns]

In [77]:
print(tfp_column)

          tfp
141 -4.782231
142 -1.377697
143 -2.636626
144  0.109814
145  2.199907
..        ...
297  1.367254
298  1.193527
299  0.641803
300  3.511677
301 -3.638582

[161 rows x 1 columns]

In [78]:
num_rows = tfp_column.shape[0]
print(num_rows)

161

In [92]:
df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'A': [7, 8, 9], 'B': [10, 11, 12]})
result = pd.concat([df1, df2], axis=0)
result

   A   B
0  1   4
1  2   5
2  3   6
0  7  10
1  8  11
2  9  12